---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MassSurfaceData.MaterialType
source: html/9218731b-4b3b-012d-3db5-a474d01e513d.htm
---
# Autodesk.Revit.DB.Analysis.MassSurfaceData.MaterialType Property

material type of mass zone

## Syntax (C#)
```csharp
public MassSurfaceDataMaterialType MaterialType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The material type does not fall within an appropriate range.
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration